

print("周长是:", 6+6+4+4, 'cm')
print("面积是:", 6*4, '平方厘米')
print("   *")
print("  * *")
print(" * * *")
print("  * *")
print("   *")
a = 1+3*5
print("a=", a)

a = 10000
b = 20000
r = 3   #cm
pi = 3.14
s = pi * r ** 2
lenght = pi * r * 2
print("s=", s , "平方厘米", "lenght=", lenght , 'cm')
print("交换前:", a , b)
a,b = b,a
print("交换后:", a , b)


print("以上为今天白天练习，以下为作业")
# －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－
# －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－
print("   *")
print("  ***")
print(" *****")
print("*******")
# －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－
# －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－
a=16
b=216
print(b//a , "斤" , b%a , "两")
# －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－
# －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－
second = 63320
m=second // 60
h=m // 60
m=second // 60 - h * 60
second2=second%60%60
print(h,"时",m,"分",second2,"秒")
# －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－
# －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－
F = 100
C = 5.0/9.0*(F-32)
K = C+273.15
print("华氏度：",F,"摄氏度：",C,"开尔文",K)